@kislerdm, I think you were right to point out that there might have been some miscommunication in your previous reply. 

Thanks for continuing the discussion. This will be a slightly longer response to provide more context and clarify our use case so you can better understand the problem.

### Our Use Case  

Our **Neon project** has a [`root` branch](https://neon.tech/docs/reference/glossary#root-branch) (referred to as `neon_project.branch{}` in the provider).  
- We use the `root branch` for **production**.  
- When developing new features, we create **feature branches** based on the `root branch`.  

### The Problem  

The **settings** for the `root branch` and `feature branches` are **completely different**:  
- **Production (`root branch`)**: Uses **higher auto-scaling** settings (`4 to 8 cu`) to ensure smooth operation.  
- **Feature branches**: Use **lower auto-scaling** settings (`0.5 to 1 cu`).  

We **do not** use the same configuration for both.  

To answer your question—yes, we are using `neon_project.default_endpoint_settings` with values `0.5 to 1 cu`. However, this only applies to **feature branches** and **does not cover the root/production branch**, which we currently adjust manually through the GUI.  

### Your Suggested Approach  

If I understood you correctly, you seem to suggest this should be possible:  

```hcl
resource "neon_project" "example" {
  name      = "example"
  region_id = "aws-us-west-2"

  branch {
    name = "production"
  }

  default_endpoint_settings {
    autoscaling_limit_min_cu = 0.25
    autoscaling_limit_max_cu = 0.5
  }
}

resource "neon_endpoint" "root_branch" {
  project_id               = neon_project.example.id
  branch_id                = neon_project.example.branch[0].id
  autoscaling_limit_min_cu = 4
  autoscaling_limit_max_cu = 8
}
```

## Why This Doesn't Work


The issue is that `neon_endpoint.root_branch` can only **create a new endpoint**, but we don't need a new one—we need to **modify** the existing endpoint for the `root branch` instead. So as expected -- the above example fails:

```hcl
neon_project.example: Refreshing state... [id=long-cherry-50618284]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # neon_endpoint.root_branch will be created
  + resource "neon_endpoint" "root_branch" {
      + autoscaling_limit_max_cu = 1
      + autoscaling_limit_min_cu = 0.5
      + branch_id                = "br-divine-morning-a6yarls2"
      + compute_provisioner      = (known after apply)
      + disabled                 = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + pooler_enabled           = (known after apply)
      + pooler_mode              = (known after apply)
      + project_id               = "long-cherry-50618284"
      + proxy_host               = (known after apply)
      + region_id                = (known after apply)
      + suspend_timeout_seconds  = (known after apply)
      + type                     = "read_write"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions in workspace "galateatech-neon"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

neon_endpoint.root_branch: Creating...
╷
│ Error: [HTTP Code: 409][Error Code: ENDPOINTS_LIMIT_EXCEEDED] read_write endpoint already exists
│ 
│   with neon_endpoint.root_branch,
│   on project.tf line 14, in resource "neon_endpoint" "root_branch":
│   14: resource "neon_endpoint" "root_branch" {
│ 
╵
```

## Proposed solution

My initial proposal was to use `neon_project.branch.endpoint_settings{}` to place the autoscaling settings for the `compute unit` used for the `root branch` as that seemed like the most straightforward solution to me. However, I'm open to other ways of referencing the existing endpoint created from `neon_project` for the root branch, such as the example below:

```hcl
resource "neon_project" "example" {
  name      = "example"
  region_id = "aws-us-west-2"
  branch {
    name = "production"
  }
  default_endpoint_settings {
    autoscaling_limit_min_cu = 0.25
    autoscaling_limit_max_cu = 0.5
  }
}

resource "neon_endpoint" "root_branch" {
  project_id               = neon_project.example.id
  branch_id                = neon_project.example.branch[0].id
  endpoint_id              = neon_project.example.branch[0].endpoint_id  # <-- References existing endpoint
  autoscaling_limit_min_cu = 0.5
  autoscaling_limit_max_cu = 1
}
```

## Next Steps

If the above approach is already possible, could you provide an example? 
The documentation doesn’t seem to suggest that's the case.

---
  
  
I hope this clarifies the issue and provides a better understanding of our use case. 
Looking forward to your thoughts!
  
  

